lkolbly/cmsis-svd/data/Cypress/MB9B460L.svd
        <!-- REGISTER "PRLH6" -->
        <register derivedFrom="PRLH0">
          <name>PRLH6</name>
          <description>PPG6 Reload Registers High</description>
          <addressOffset>0x251</addressOffset>
        </register>
        <!-- REGISTER "PRLL6" -->
        <register derivedFrom="PRLL0">
          <name>PRLL6</name>
          <description>PPG6 Reload Registers Low</description>
          <addressOffset>0x250</addressOffset>
        </register>
        <!-- REGISTER "PRLH7" -->
        <register derivedFrom="PRLH0">
          <name>PRLH7</name>
          <description>PPG7 Reload Registers High</description>
          <addressOffset>0x255</addressOffset>
        </register>
        <!-- REGISTER "PRLL7" -->
        <register derivedFrom="PRLL0">
          <name>PRLL7</name>
          <description>PPG7 Reload Registers Low</description>
          <addressOffset>0x254</addressOffset>
        </register>
        <!-- REGISTER "PRLH8" -->
        <register derivedFrom="PRLH0">
          <name>PRLH8</name>
          <description>PPG8 Reload Registers High</description>
          <addressOffset>0x289</addressOffset>
        </register>
        <!-- REGISTER "PRLL8" -->
        <register derivedFrom="PRLL0">
          <name>PRLL8</name>
          <description>PPG8 Reload Registers Low</description>
          <addressOffset>0x288</addressOffset>
        </register>
        <!-- REGISTER "PRLH9" -->
        <register derivedFrom="PRLH0">
          <name>PRLH9</name>
          <description>PPG9 Reload Registers High</description>
          <addressOffset>0x28D</addressOffset>
        </register>
        <!-- REGISTER "PRLL9" -->
        <register derivedFrom="PRLL0">
          <name>PRLL9</name>
          <description>PPG9 Reload Registers Low</description>
          <addressOffset>0x28C</addressOffset>
        </register>
        <!-- REGISTER "PRLH10" -->
        <register derivedFrom="PRLH0">
          <name>PRLH10</name>
          <description>PPG10 Reload Registers High</description>
          <addressOffset>0x291</addressOffset>
        </register>
        <!-- REGISTER "PRLL10" -->
        <register derivedFrom="PRLL0">
          <name>PRLL10</name>
          <description>PPG10 Reload Registers Low</description>
          <addressOffset>0x290</addressOffset>
        </register>
        <!-- REGISTER "PRLH11" -->
        <register derivedFrom="PRLH0">
          <name>PRLH11</name>
          <description>PPG11 Reload Registers High</description>
          <addressOffset>0x295</addressOffset>
        </register>
        <!-- REGISTER "PRLL11" -->
        <register derivedFrom="PRLL0">
          <name>PRLL11</name>
          <description>PPG11 Reload Registers Low</description>
          <addressOffset>0x294</addressOffset>
        </register>
        <!-- REGISTER "PRLH12" -->
        <register derivedFrom="PRLH0">
          <name>PRLH12</name>
          <description>PPG12 Reload Registers High</description>
          <addressOffset>0x2C9</addressOffset>
        </register>
        <!-- REGISTER "PRLL12" -->
        <register derivedFrom="PRLL0">
          <name>PRLL12</name>
          <description>PPG12 Reload Registers Low</description>
          <addressOffset>0x2C8</addressOffset>
        </register>
        <!-- REGISTER "PRLH13" -->
        <register derivedFrom="PRLH0">
          <name>PRLH13</name>
          <description>PPG13 Reload Registers High</description>
          <addressOffset>0x2CD</addressOffset>
        </register>
        <!-- REGISTER "PRLL13" -->
        <register derivedFrom="PRLL0">
          <name>PRLL13</name>
          <description>PPG13 Reload Registers Low</description>
          <addressOffset>0x2CC</addressOffset>
        </register>
        <!-- REGISTER "PRLH14" -->
        <register derivedFrom="PRLH0">
          <name>PRLH14</name>
          <description>PPG14 Reload Registers High</description>
          <addressOffset>0x2D1</addressOffset>
        </register>
        <!-- REGISTER "PRLL14" -->
        <register derivedFrom="PRLL0">
          <name>PRLL14</name>
          <description>PPG14 Reload Registers Low</description>
          <addressOffset>0x2D0</addressOffset>
        </register>
        <!-- REGISTER "PRLH15" -->
        <register derivedFrom="PRLH0">
          <name>PRLH15</name>
          <description>PPG15 Reload Registers High</description>
          <addressOffset>0x2D5</addressOffset>
        </register>
        <!-- REGISTER "PRLL15" -->
        <register derivedFrom="PRLL0">
          <name>PRLL15</name>
          <description>PPG15 Reload Registers Low</description>
          <addressOffset>0x2D4</addressOffset>
        </register>
        <!-- REGISTER "PRLH16" -->
        <register derivedFrom="PRLH0">
          <name>PRLH16</name>
          <description>PPG16 Reload Registers High</description>
          <addressOffset>0x309</addressOffset>
        </register>
        <!-- REGISTER "PRLL16" -->
        <register derivedFrom="PRLL0">
          <name>PRLL16</name>
          <description>PPG16 Reload Registers Low</description>
          <addressOffset>0x308</addressOffset>
        </register>
        <!-- REGISTER "PRLH17" -->
        <register derivedFrom="PRLH0">
          <name>PRLH17</name>
          <description>PPG17 Reload Registers High</description>
          <addressOffset>0x30D</addressOffset>
        </register>
        <!-- REGISTER "PRLL17" -->
        <register derivedFrom="PRLL0">
          <name>PRLL17</name>
          <description>PPG17 Reload Registers Low</description>
          <addressOffset>0x30C</addressOffset>
        </register>
        <!-- REGISTER "PRLH18" -->
        <register derivedFrom="PRLH0">
          <name>PRLH18</name>
          <description>PPG18 Reload Registers High</description>
          <addressOffset>0x311</addressOffset>
        </register>
        <!-- REGISTER "PRLL18" -->
        <register derivedFrom="PRLL0">
          <name>PRLL18</name>
          <description>PPG18 Reload Registers Low</description>
          <addressOffset>0x310</addressOffset>
        </register>
